//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// Item Status Parts
//
// Programed By Yukari-World
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Drawing;
using System.Data;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace Status_Editer.User_Control.CommonParts {
	public partial class ItemStatusParts : UserControl {
		//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
		// Initialize
		//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

		private Label StatusBar = new Label();


		//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
		// Property
		//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

		/// <summary>
		/// ステータスラベルを設定します
		/// </summary>
		[Description("ステータスラベルを設定します")]
		public string StatusLabel {
			get { return label1.Text; }
			set { label1.Text = value; }
		}// End Property


		//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
		// Constructor Method
		//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

		/// <summary>
		/// コンストラクタメソッド
		/// </summary>
		public ItemStatusParts() {
			InitializeComponent();
		}// End Method


		//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
		// Pubilc Function
		//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


		//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
		// Private Function
		//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


		//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
		// Control Method
		//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

		/// <summary>
		/// フォーム読み込み時の処理
		/// </summary>
		/// <param name="sender">object</param>
		/// <param name="e">EventArgs</param>
		private void ItemStatusParts_Load(object sender, EventArgs e) {

			// Labelの初期化
			StatusBar.AutoSize = false;
			StatusBar.BackColor = Color.Green;
			StatusBar.BorderStyle = BorderStyle.FixedSingle;
			StatusBar.Name = "StatusBar";
			StatusBar.Location = new Point(200, 7);
			StatusBar.Size = new Size(Math.Max((int)numericUpDown1.Value * 1, 0), 6);

			// LabelをUser Controlに追加する
			Controls.Add(StatusBar);

		}// End Function

		/// <summary>
		/// コントロールを再描画時に実行する処理
		/// </summary>
		/// <param name="sender">object</param>
		/// <param name="e">PaintEventArgs</param>
		private void ItemStatusParts_Paint(object sender, PaintEventArgs e) {
			// ラインを引く
			// 所謂横棒グラフのライン
			Pen myPen;
			myPen = new Pen(Color.Black);
			Graphics formGraphics = CreateGraphics();
			// ラインを X = 200, 300, 400 に描画
			formGraphics.DrawLine(myPen, 200, 0, 200, 20);
			formGraphics.DrawLine(myPen, 300, 0, 300, 20);
			formGraphics.DrawLine(myPen, 400, 0, 400, 20);
			// 破棄破棄
			myPen.Dispose();
			formGraphics.Dispose();
		}

		/// <summary>
		/// numericUpDown1の値が変更された時の処理
		/// </summary>
		/// <param name="sender">object</param>
		/// <param name="e">EventArgs</param>
		private void numericUpDown1_ValueChanged(object sender, EventArgs e) {
			// ラベルのサイズ変更
			StatusBar.Size = new Size(Math.Max((int)numericUpDown1.Value * 1, 0), 10);
		}
	}// End Class
}
